**단계 1:** pandas 패키지를 import 하는 과정

In [1]:
# 본 예제에서는 pandas를 사용하여 DataFrame 객체를 제어합니다.
# 이를 위해서 pandas의 DataFrame 객체를 사용할수 있도록 합니다.

import pandas as pd
from pandas import DataFrame

In [ ]:
**단계 2:** 두개의 DataFrame 객체를 선언하고 병합을 합니다.

In [2]:
df_left = DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
 'A': ['A0', 'A1', 'A2', 'A3'],
 'B': [0.5, 2.2, 3.6, 0.4]})

df_right = DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
'C': ['C2', 'C3', 'C4', 'C5'],
'D': ['D2', 'D3', 'D4', 'D5']})

df_all = pd.merge(                        )

**단계 3:** 병합된 데이터에서 결측값을 확인합니다.

In [3]:
df_all

  KEY    A    B    C    D
0  K0   A0  0.5  NaN  NaN
1  K1   A1  2.2  NaN  NaN
2  K2   A2  3.6   C2   D2
3  K3   A3  0.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [28]:
**단계 4:** 병합된 데이터에서 결측값을 확인합니다.

In [29]:
# 결측값을 확인하기 전에 먼저 데이터 프레임의 값을 확인합니다.
df_all

  KEY    A    B    C    D
0  K0   A0  0.5  NaN  NaN
1  K1   A1  2.2  NaN  NaN
2  K2   A2  3.6   C2   D2
3  K3   A3  0.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

padnas.isnull() 함수는 관측치가 결측값이면 true, 아니면 false 값을 보여줍니다.
pandas.notnull() 함수는 isnull() 함수와 반대의 의미입니다.

In [5]:
pd.isnull(df_all)

     KEY      A      B      C      D
0  False  False  False   True   True
1  False  False  False   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [6]:
# isnull() 함수를 사용하여 확인하는 방법은 다른 방법도 존재합니다.
# padnas.isnull()을 사용하여 출력하거나, isnull(pandas) 방식으로 사용가능합니다.
# 여기서는 pandas.insull()을 사용하여 출력합니다.
df_all.isnull()

     KEY      A      B      C      D
0  False  False  False   True   True
1  False  False  False   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [7]:
# notnull() 함수를 사용하여 확인하는 방법은 다른 방법도 존재합니다.
# padnas.notnull()을 사용하여 출력하거나, notnull(pandas) 방식으로 사용가능합니다.
# 여기서는 pandas.notnull(pandas)을 사용하여 출력합니다.
pd.notnull(df_all)

    KEY      A      B      C      D
0  True   True   True  False  False
1  True   True   True  False  False
2  True   True   True   True   True
3  True   True   True   True   True
4  True  False  False   True   True
5  True  False  False   True   True

In [8]:
df_all.notnull()

    KEY      A      B      C      D
0  True   True   True  False  False
1  True   True   True  False  False
2  True   True   True   True   True
3  True   True   True   True   True
4  True  False  False   True   True
5  True  False  False   True   True

**단계 5:** 결측값의 갯수를 확인합니다.

In [9]:
# 결측값의 갯수를 확인하기 위해서는
# 열단위는 DataFrame.isnull().sum()
# 행단위는 DataFrame.isnull().sum(1) 로 사용합니다.

df_all.isnull().sum()

KEY    0
A      2
B      2
C      2
D      2
dtype: int64

In [11]:
df_all.isnull().sum(1)

0    2
1    2
2    0
3    0
4    2
5    2
dtype: int64

**단계 6:** 결측값의 갯수를 확인하고, 이를 DataFrame 객체에 반영합니다.

In [12]:
# 여기서는 A 열에 해당되는 데이터 중에서 결측값의 갯수를 확인하고, 이를 출력합니다.
# isnull().sum()은 특정 열 또는 행에서 발생한 결측값의 갯수를 알려줍니다.
df_all['A'].isnull().sum()

2

In [13]:
# A 열에 존재하는 결측값의 갯수과 DataFrame을 확인하여 정말로 맞는지 확인합니다.
df_all

  KEY    A    B    C    D
0  K0   A0  0.5  NaN  NaN
1  K1   A1  2.2  NaN  NaN
2  K2   A2  3.6   C2   D2
3  K3   A3  0.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [20]:
# 열 단위로 결측값의 갯수를 확인합니다.
df_all.isnull().sum()

KEY        0
A          2
B          2
C          2
D          2
NaN_cnt    6
dtype: int64

In [21]:
# 행 단위로 결측값의 갯수를 확인합니다.
df_all.isnull().sum(1)

0    3
1    3
2    1
3    1
4    3
5    3
dtype: int64

In [30]:
# DataFrame에 새로운 열을 추가하기 위해서는
# DataFrame_이름['새로운 열 이름']=cell 내용 식으로 사용합니다.

df_all[       ] = df_all.notnull().sum(1)
df_all[       ] = df_all.isnull().sum(1)

In [31]:
df_all

  KEY    A    B    C    D  NotNull_cnt  NaN_cnt
0  K0   A0  0.5  NaN  NaN            3        2
1  K1   A1  2.2  NaN  NaN            3        2
2  K2   A2  3.6   C2   D2            5        0
3  K3   A3  0.4   C3   D3            5        0
4  K4  NaN  NaN   C4   D4            3        2
5  K5  NaN  NaN   C5   D5            3        2